{"email": "Dear Joseph,\n\nI would like you to fill up and reply with the enclosed quotation by tomorrow 7 am as I require that document to consolidate for the report.\n\nAlso due to some family emergency, I would like to extend the deadline for submission of the new product diagram. I hope you would not mind that the diagram might be late, but I have some rough sketches you can look though and give some opinions while I work on the diagram.\n\nThank you,\nPatricia", "summary": "- fill in the attached document by tomorrow 7 am\n- extend deadline for submission of diagram due to family emergency"}
{"email": "Hi Billy,\n\nCould you help to explain the topic of the current project to me as I do not have much experience in this type of project. Your explanation always help me to understand better, so hopefully this time you could do the same. I can treat you to a meal during the explanation.\n\nThanks,\nAlicia", "summary": "- explain the topic"}
{"email": "Hi Justina,\n\nGeorge asked me to check with you if you have approved George's request to have work from home arrangement. He needs to take care of his children at home during the school holiday, so do help to approve it as soon as possible.\n\nThe director also asked me to inform you that you need to forward your progress document to him as he wants to see everyones current progress. Hopefully this time we all are on the right track.\n\nThanks,\nSusan", "summary": "- approve George's request to have work from home arrangement\n- forward the document to her director"}
{"email": "Dear Sheree,\n\nI noticed that many of us are having some difficulty working on this project with many mistakes being made. I hope everyone would buck up and focus for now, hopefully you would too. And so please fill up the attached spreadsheet by this Tue 4 am so that we can move on to the next step. Late submission would not be tolerated.\n\nThank you,\nRobert  ", "summary": "- fill in the attached document by this Tue 4 am"}
{"email": "Hey Dawn,\n\nCan you stop doing something else when we are in a meeting, it is very distracting and you always need others to repeat whatever is said back to you. Also, please push back the deadline for submission of the spreadsheet. I know that you believe that we all are on track but actually some of us have some urgent matters for other work and would appreciate the additional time. Hopefully you would actually pay attention during the meeting and understand everyone problems.\n\nThanks,\nArthur  ", "summary": "- extend deadline for submission of spreadsheet due to urgent matters"}
{"email": "Hi Michelle,\n\nDo help to finalize the attached document by this Wed 10 pm. Also do help to verify that today's sharing agenda is about next quarter's goals. If possible, can we delay the Skype review scheduled for this Wednesday as I need more time to finish my part for the review. \n\nThank you very much.\n\nRegards,\nRobinson ", "summary": "- fill in the attached document by this Wed 10 pm\n- confirm that today's meeting agenda is about next quarter's goals \n- postpone the meeting scheduled for this Wednesday"}
{"email": "Dear Mrs Martha,\n\nMy team member Gary has requested to go on medical leave, could you help to approve it as soon as possible. Also please email the proposal from us to Mr Johnnie from marketing, the team would appreicate your kindness.\n\nBest Regards,\nJames", "summary": "- approve Gary's request to go on medical leave\n- forward the document to Johnnie"}
{"email": "Vickie,\n\nThe team have a new plan for the project currently. We would not be using your idea anymore and I hope you would not be upset with this arrangement. Hope to work with you in another time.\n\nFreida  ", "summary": "NONE"}
{"email": "Hey David,\n\nAttached is the department survey from the HR department. Reply to us by next Thurday with your completed survey to stand a chance in winning a variety of rewards. We hope to have a 100% particapateion rate from everyone in the company.\n\nThank you.\nMark", "summary": "- acknowledge this email by next Thur"}
{"email": "Leroy,\n\nCould you reschedule the discussion planned for tomorrow as some of us are still not ready while working with your ideas and need more time to finish. Although your idea is great, but many details are left out and require additional research to understand it. Hope you would not mind the reschedule as we are trying to follow your idea closely.\n\nFrank ", "summary": "- postpone the meeting scheduled for tomorrow"}
{"email": "Dear Antonio,\n\nCould you fill in and reply with the enclosed file by this Mon 5 am as we need it urgently. Thank you.\n\nAlso, could you tell us what you think about the work plan for the next few days as I hope we can have a comfortable work experience by looking through the opinions from the team.\n\nBest regards,\nGeorge ", "summary": "- fill in the attached document by this Mon 5 am\n- give feedback"}
{"email": "Hi Corey,\n\nI would like to have some feedback from you with regards to my work and how I could improve on it. I hope to have more responsilbity as currently I am just working on simple tasks.\n\nBy the way, can you forward the quotation to your group director Josh, he personally came down to ask for it but you are not around when it happened. Please remember to do it please.\n\nThanks,\nJohn", "summary": "- give feedback\n- forward the document to his group director"}
{"email": "Hey Denise,\n\nLong time never see you in the office, hopefully you are still well. I have send you a survey and a legal contract to be critiqued. The survey need to be completed by tomorrow 8 am while the legal contract checked by next Mon. Hopefully this time you can stay in the office a little while longer.\n\nBest,\nKirby  ", "summary": "- fill in the attached document by tomorrow 8 am\n- review the attached document by next Mon"}
{"email": "Hi Kevin,\n\nJust to check, is tomorrow's sharing agenda about latest trends? Is there any direction we should follow during the sharing and is there food and drinks provided? Hope this sharing session would be fruitful and enjoyable for everyone.\n\nThanks,\nAlan  ", "summary": "- confirm that tomorrow's meeting agenda is about latest trends "}
{"email": "Dear Katherine,\n\nI am unable to continue to work on your proposed plan. It is unfeasible with such a low budget given and your team is unresponsive to my request for a higher budget. I hope you would be able to find another company for this project.\n\nRegards,\nGary   ", "summary": "NONE"}
{"email": "Dear Charlene,\n\nWith regards to your recent work, I feels that you are not following the plan and is making our time harder to resolve the additional problems caused by your side. As such, I would have to cancel your service for the project as we have found a better partner. I appreciate your hard work this past few weeks but it is not up to our standard. I would compensate for your time and sorry for any inconvenience caused.\n\nBest regards,\nNatasha", "summary": "NONE"}
{"email": "Hey Joel,\n\nCould you give further explanations about what you mean in your previous email? It is quite sudden that you are experiencing an urgent matters currently and might need to take some time off. I hope you could let me know what is the current status of your work and hopefully the group can help in any ways we could. Even if you are unwell now, please perform up to standard for your work when you are ready to submit it. Thank you and have a nice day.\n\nPaula ", "summary": "- explain the topic\n- give an update"}
{"email": "Dear Joseph,\n\nWe would have to rearrange the Skype discussion scheduled for next Wednesday as some group members are having an important overseas conference during that time.\n\nWe would also be having an email update today, so do email the form to Shanna as she is your partner.\n\nLastly, we would like to have some ideas from everyone for the department party next week, do suggest some of your recommendations for foods and entertainment.\n\nThank you for your time.\n\nRegards,\nLavonia", "summary": "- postpone the meeting scheduled for next Wednesday\n- forward the document to Shanna\n- give feedback"}
{"email": "Hi Linda,\n\nCould you be responsive when attending to a company call in the office? People has complained that when you are the receiver of their calls, you always left them hanging and they are annoyed of having a long period of silence before you reply. If possible next time you could acknowledge them first then ask for some time if you are still thinking about the answer. This is much better than giving them the silence treatment. Hopefully this email will help you to improve in answering the calls and there will be less complains about you.\n\nRegards,\nFreda  ", "summary": "NONE"}
{"email": "Dear Matthew,\n\nWe are having some urgent issues. Can you send the quotation to Tiffanie from the IT department, she wants to take a look at it. \n\nAlso please complete the attached contract by tomorrow 10 am, we would be needing it on tommorrow afternoon.\n\nFurthermore, can you prolong the timeline for submission of invoice as there are new priorities emerging. These new priorities are clashing with our current work and I hope the higher up can resolve this as soon as possible.\n\nHopefully we would have an easier time after resolving these issues. Thank you and have a great day ahead.\n\nBest regards,\nFrank", "summary": "- forward the document to Tiffanie\n- fill in the attached document by tomorrow 10 am\n- extend deadline for submission of invoice due to new priorities"}
{"email": "Hi Craig,\n\nThank you for scheduling another meeting, the previous meeting has helped me in looking out for mistakes in my report and hopefully this meeting would be another great session.\n\nAnyway, how are things going on your side? I hope this meeting is not a great burden for you and lets have some coffee as a treat from me during the meeting.\n\nThank you for the help.\n\nPaul ", "summary": "- give an update"}
{"email": "Hello Ann,\n\nYou have send the business plan email to the wrong person. Our partner has been asking for it and after checking with some coworkers, I realised the recipient for your email is wrong.\n\nI have sent your email to our partner on my side and so you do not have to do anything else. I hope you would not commit this kind of major mistake anymore as it affect our company reputation.\n\nRegards,\nMarion  ", "summary": "NONE"}
{"email": "Hello Herman,\n\nI have a great time today discussing with you about my work plan for group. However, I would you to rearrange the review scheduled for tomorrow as I might be unavailable during that time. Hope you would not mind this arrangement and have a great day ahead.\n\nThanks and good luck,\nDavid", "summary": "- postpone the meeting scheduled for tomorrow"}
{"email": "Dear Amy\n\nWe are facing an important matter right now, and I need you to approve Kathleen's request to get more resources for our product. Please do take note of this situation and act on it soon as we do not have much time left till the next deadline. Thank you very much.\n\nRegards,\nLatoya  ", "summary": "- approve Kathleen's request to get more resources"}
{"email": "Dear Naomi,\n\nI would like you to call off the review scheduled for tomorrow as we would be having it at a later date due to a sudden influx of new ideas. There are many suggestions given to us from the different branches and I would like you to look through them and give your recommendations. Hopefully you would have some favourites among those ideas.\n\nYou should submit and reply regarding those ideas with the enclosed form by this Monday 9 pm. Do take your time and we will plan another meeting after you have submitted the form.\n\nBest regards,\nJason", "summary": "- postpone the meeting scheduled for tomorrow\n- give feedback\n- fill in the attached document by this Monday 9 pm"}
{"email": "Hello James,\n\nRemember to let me know how things are going as you have not been attending the online meeting regularly recently. I hope you are still well and continue to keep a healthy mind and body.\n\nAnyway, attached is the enclosed invoice you requested, do fill in and reply with it by tomorrow 7 am. And also do provide some feedback on how we can improve the online meeting as some of us are requesting to meet in other ways.\n\nI wish all the best with your work. Thank you and have a nice day.\n\nRegards,\nKevin", "summary": "- give an update\n- fill in the attached document by tomorrow 7 am\n- give feedback"}
{"email": "Hey Robert,\n\nPlease follow to our office rules for your work, you should put in some effort and stop causing us trouble. A lot of people have been wanting to see you to complain about your work ethics and I have been appeasing them by saying you would improve. This is your last chance and please do not make me make a difficult decision. Thank you and all the best. \n\nJoan", "summary": "NONE"}
{"email": "Dear Willie,\n\nRead your email, there are a lot of important emails coming your way this week and you should be on a look out for them. You might also want to delay the due date for submission of draft due to this urgent matters. Please reply to this email by next Monday. Thank you very much.\n\nBest regards,\nJordan ", "summary": "- acknowledge this email by next Monday\n- extend deadline for submission of draft due to urgent matters"}
{"email": "Dear Lorraine,\n\nGreat job. I can see your improvement in your recent report and do continue to work hard. However, I would need you to give further explanations on the customer feedback section in your report as there are some details missing. Do remember to always check everything are in place before submitting your work. Thank you and great work.\n\nRegards,\nMichell ", "summary": "- explain the topic"}
{"email": "Hi Sandra,\n\nWould you set up a sharing at 5 am for next Thu in the lounge as some members of the marketing department want to understanding the your proposed plan better. We will provide food and drink on our side, do give let us know your recommendations. Hope to see you there.\n\nThanks,\nJoanne", "summary": "- book a meeting at 5 am for next Thu\n- give feedback"}
{"email": "Dear Brian,\n\nWelcome to Team 3. We all look forward to working with you and hope you will have a great time in our team. If you need any help, feel free to contact any of us. However, we want to respect personal time of each other and so please do not expect reply at all time, especially at night. We want to know more about you, hence could you prepare an introduction about yourself for the time being. We look forward to hear from you by this Friday. \n\nRegards,\nTeam 3", "summary": "- acknowledge this email by this Fri"}
{"email": "Dear Mr Lim,\n\nCould you postpone the deadline for submission of the accounting Word document. There is some unexpected delays of the arrival of the products and I need more time to account for all the products.\n\nAttached is the enclosed financial report for the previously arrived products. Could you scrutinize it by tomorrow and let me know if there is any problem.\n\nThank you for all the help you have given, I look forward to hear from you by tomorrow.\n\nRegards,\nBrandon", "summary": "- review the attached document by tomorrow\n- extend deadline for submission of Word document due to unexpected delays\n- acknowledge this email by tomorrow"}
{"email": "Dear Mrs Lee,\n\nI would like to inform you that the team will be having a brain storming session about the new product. Could you create a Microsoft Teams chat invite for next Wednesday at 11pm so that everyone could join in to discuss. Your help would be much appreciated.\n\nRegards,\nDaniel", "summary": "- schedule an online meeting on at 11 pm for next Wednesday"}
{"email": "Dear Mr Wong,\n\nCould you confirm that this Thursday discussion agenda is about next quarter's goals? There are somes issues in the meeting timeline as many people are falling sick and could not attend some of the meetings. Hence could you also delay the Microsoft Teams meeting scheduled for next Tuesday with Mr Johnson as we are not ready for the discussion with him at our current rate.\n\nThank you,\nMisty", "summary": "- confirm that this Thu's meeting agenda is about next quarter's goals \n- postpone the meeting scheduled for next Tuesday"}
{"email": "Dear Mrs Tan,\n\nThere is too much work for the HR department recently, and so we would want to increase our headcount. Steven has send you the request and so could you help to approve it? The higher headcount will surely let the department feels much better and will become more productive. Thank you and have a nice day.\n\nRegards,\nIris", "summary": "- approve Steven's request to increase headcount"}
{"email": "Amy,\n\nGo send a Microsoft Teams invitation to Mr Rayson and Mr James for this Fri at 9 am. We will be having an important meeting and I want you to be a moderator for it.\n\nAlso help me to validate Ronald's request to get more manpower. I will be out for these few days and so help me to keep a lookout for other important matters.\n\nBoss ", "summary": "- schedule an online meeting on at 9 am for this Fri\n- approve Ronald's request to get more manpower"}
{"email": "Brendan\n\nPlease forward your business report to me. I want to take a look at it before you submit to the higher up. Keep up the good work.\n\nSupervisor", "summary": "- forward the document to his supervisor"}
{"email": "Dear Boss,\n\nCould you approve my request have work from home arrangement for this week? There is a need for it as I would like to take care of my parents, they recently fell sick and need help in getting around. I will still be attending this week conference online so there is no issue for that. Thank you.\n\nRegards,\nRosie", "summary": "- approve Rosie's request to have work from home arrangement"}
{"email": "Dear Supervisor,\n\nI want to thank you for the help you have given me this past few days. Through those discussion, I have learnt so much about this industry and what I want to do next. If possible, I would want to continue to work with you in the future. Thanks alot.\n\nRegards,\nMargaret", "summary": "NONE"}
{"email": "Hi Cincy,\n\nThanks for the help. I am now done with my report and can move on to other component. Your assistance make my disappointing report into something remarkable, truly a silver of hope for me. Now I am ready to face any challenges coming my way together with you. Thanks alot. \n\nThomas", "summary": "NONE"}
{"email": "Antonio,\n\nWe will be having a meeting with the investors, please book conference room 1 at 8 am for tomorrow. I want everyone in your team to be present and be interactive during the meeting. The investors will be looking at us so please do not disappoint me.\n\nDenise   ", "summary": "- book a meeting at 8 am for tomorrow"}
{"email": "Dear manager,\n\nCould you allow my friend Rose to go on her childcare leave. She has been requesting for it since last week and has seek help from me to assist her in this matter. \n\nI am willing to take on her role temporary, so could you explain her job scope for me to take over it. Rose will be back when her found a childcare to take care of her child. There will be no issues during this period, I promise you. \n\nThank you and have a nice day. \n\nRegards,\nJane", "summary": "- approve Rose's request to go on childcare leave\n- explain the topic"}
{"email": "Dear boss,\n\nAndrew has requested to have hybrid work arrangement with me and I would like to check if you will approve his request. He has been working well with us and recently he wants more time to himself to take care of his mental health. I would keep track of his progress so that nothing will go wrong with this arragement.\n\nSince there has been a lot of requests for hybrid work arrangement, is there any suggestion you would like to give so that we could have a more cohesive working environment for everyone. I am sure that your ideas will benefit us and so do provide anything you would prefered.\n\nThanks alot for the kindness you have shown to everyone on the team.\n\nBest regards,\nRobinson", "summary": "- approve Andrew's request to have hybrid work arrangement\n- give feedback"}
{"email": "Hey Thomas,\n\nRemember to send the invoice to the supervisor as he wants it by tomorrow. Please give me a reply by today after seeing this email. I do not want to be in trouble for something I could have done myself, but the supervisor just prefer your work.\n\nRegards,\nGeorge", "summary": "- forward the document to his supervisor\n- acknowledge this email by today"}
{"email": "Dear Freida,\n\nCould you help me to create a Skype discussion invite for tomorrow at 8am? I need your help in creating that as my account has been locked out for some reason. Thanks for the help.\n\nBest regards,\nLouis", "summary": "- schedule an online meeting on at 8 am for tomorrow"}
{"email": "Dear William\n\nPlease review the attached invoice by this Thursday. I want you to complete the new invoice by this Fri 6 pm and reply to this email with it attached. Finish this before going off. Thanks.\n\nRegards,\nMartha", "summary": "- review the attached document by this Thu\n- fill in the attached document by this Fri 6 pm\n- acknowledge this email by today"}
{"email": "Dear Megan,\n\nThere is a change in plan. I need you to push back the deadline for submitting the accounting spreadsheet as there is some errors spotted. Help me tell everyone about this change due to this sudden situation. \n\nYour sincerely,\nJoshua", "summary": "- extend deadline for submission of spreadsheet due to urgent matters"}
{"email": "Dear Jess,\n\nI have requested for a change in schedule, could you reschedule the discussion on this Tues to some other day?\n\nAlso I having a family emergency to attend to, so could you help me to push back the timeline for the submission of survey form from everybody since I have no time to look through now.\n\nYour sincerely\nTom", "summary": "- postpone the meeting scheduled for this Tues\n- extend deadline for submission of form due to family emergency"}
{"email": "Dear Gary\n\nCan you give me an update on the current situation? I heard that there is something going wrong on your side that is affecting the production line. Also can you check that next Tuesday's discussion agenda is about design review. I hope everybody is informed about this and should be ready to present on what they think is good. Hopefully everything will be settled soon.\n\nYour Sincerely,\nCharles", "summary": "- give an update\n- confirm that next Tuesday's meeting agenda is about design review "}
{"email": "Dear Beverly,\n\nCan we talk? I know there is something wrong going on between us and we should resolve it. But you have been ignoring me in the office or on social media. I hope this email will reach you and please let me have a chance to talk with you. Just once is enough for me please.\n\nYour Sincerely,\nJorge", "summary": "NONE"}
{"email": "Dear James,\n\nI had an enjoyable meeting with you and I look forward to working together in future projects! However, please refrain from contacting me without any purpose.\n\n Unfortunately, your plan cannot proceed due to our limited budget.\n\nRegards, Christopher", "summary": "NONE"}
{"email": "Marshall,\n\nThanks for attending the meeting last week, glad that you followed our plan as discussed. Can you be more in depth about what you mean, and explain the topic to me? The call was not good at all. Can you also rearrange the Slack review happening next Wed, and check that the agenda next Tues's review is about design review?\n\nThanks, Lauri", "summary": "- confirm that next Tues's meeting agenda is about design review\n- explain the topic\n- postpone the meeting scheduled for next Wed"}
{"email": "Hey Kurt,\n\nThanks for the great catchup yesterday, it was a good idea to meet up! As spoken, do keep me updated on the current status of the project.\n\nBy the way, I have been feeling stressful recently and I would appreciate if you could cause me less grief.\n\n Cheers! Mildred", "summary": "- give an update"}
{"email": "Hi Michael,\n\nHere to check in about the plan, unfortunately, it cannot be done due to time constraints. I would like to meet up to discuss about the next steps of the plan.\n\nMay I trouble you to send a Skype invitation for the 10am meeting tomorrow? I will also need you to finish up the report by next Thu 10 pm. I have attached it to this email.\n\n Thank you so much! Cheers, Patsy", "summary": "- schedule an online meeting on at 10 am for tomorrow\n- fill in the attached document by next Thu 10 pm"}
{"email": "Louise,\n\nGood conversation, but can you re-explain the goals for next quarter? Also, do I always need to remind you to read your email? Your performance so far has been reflecting badly on your work standards!\n\nGood work rescheduling the meeting. Please confirm if today's chat agenda is about the company's company on this quarterly's goals.\n\nThanks,\nRandy", "summary": "- confirm that today's meeting agenda is about progress on quarterly goals\n- explain the topic"}
{"email": "Hi Randall!\n\nIt's nice to meet you, I have recently joined your team. I sincerely apologise for not performing my role up to par.\n\nWarm Regards,\nPatricia", "summary": "NONE"}
{"email": "Hi Tim!\n\nFirstly, I would like to apologise for the inconvenience I have caused. Thank you so much for rearranging the meeting, I highly value you help.\n\nUnfortunately, your approach is unlike the one we discussed previously. I would appreciate if you do not deviate from the initial plan.\n\nThanks,\nAndrew", "summary": "NONE"}
{"email": "Hey Tiffany!\n\nApologies for not replying earlier, I have an enormous amount of emails to go through everyday. We went off topic many times during the meeting the other day, hopefully we can be more productive in the future.\n\nThank you for not disregarding me the other day, I am excited to work with you on future projects!\n\nCheers!\nRobert", "summary": "NONE"}
{"email": "Dear Alana\n\nNice to meet you, I am new to the company and I have the pleasure of joining your team!\n\nSorry to trouble you, but could you assist in scheduling a review session next Tuesday? 4pm would be great!\n\nThank you!\nDana", "summary": "- book a meeting at 4 pm for next Tues"}
{"email": "Matthew,\n\nThis is an urgent email, please reply to acknowledge that you have received this email by today.\n\nGood work assisting me during the catchup, just as I expected of you. I have some new tasks for you, can you approve George's hybrid work arrangement request? Can you also postpone the Slack sharing planned for this Thursday?\n\nPlease note that I would prefer correspondence via email rather than meeting, whether physically or online.\n\nColin", "summary": "- postpone the meeting scheduled for this Thur\n- acknowledge this email by today\n- approve George's request to have hybrid work arrangement"}
{"email": "Dear Tina,\n\nAlyssa here, I am a new employee and I will be a part of your team. I am sorry for causing inconvenience the other day, please accept my apology.\n\nExcited to work with you.\n\nRegards,\nAlyssa", "summary": "NONE"}
{"email": "Hi Kenneth,\n\nJust a heads up, I am not familiar with the topic, so I might not be going for the discussion with you. \n\nMay I trouble you to help me with some tasks? Please email the attached spreadsheet to Elizabeth, preferably by today. Also, other projects with higher priorities have just come in, so I would appreciate it if you could delay the submission of the diagram.\n\nThanks!\nHerbert", "summary": "- extend deadline for submission of diagram due to new priorities\n- forward the document to Elizabeth"}
{"email": "Hey Octavio,\n\nI am sincerely sorry for the sub-par work submitted, I have been facing some personal issues. Just to follow up, the quality of discussion of the call yesterday could be improved, it was not enjoyable at all.\n\nCheers,\nJeffrey", "summary": "NONE"}
{"email": "Hi Dana!\n\nAfter our catchup last Friday, I now understand you better and am looking forward to working with you! Could you let me know what you think about the upcoming project?\n\nOne last thing, unfortunately, I may not be able to make it for the meeting with you next week. Is it possible to reschedule? Thanks!\n\nCheers!\nShirley", "summary": "- give feedback"}
{"email": "Hey Gregory,\n\nI have been busy recently, and it would be great if you do not contact me without a good reason. Thank you for letting me shadow you yesterday, I learnt a lot from you.\n\nCould I trouble you to read the email I sent you yesterday? I need you to prolong the deadline for the submission of the PDF document as new priorities have just came in.\n\nLet me know when you have done so.\n\nCheers!\nBeverly", "summary": "- extend deadline for submission of PDF document due to new priorities"}
{"email": "Hi Fred!\n\nI had a wonderful time meeting you last Wednesday! I would prefer being contacted through email about work information thou. I have attached a PDF document to this email, could you complete it and send it back to me by 8 pm tomorrow?\n\nPlease send a copy to Eric as well. May I also check that the agenda for this Thurs' meeting is about the company's performance recently?\n\nThanks,\nMariann", "summary": "- fill in the attached document by tomorrow 8 pm\n- confirm that this Thursday's meeting agenda is about recent performance \n- forward the document to Eric"}
{"email": "Hey Juli!\n\nThanks for the call yesterday, it was really great! Unfortunately, I am writing this email to let you know that your negotiation with the partner company was sub-par and I expected more from you.\n\nPlease do not hesitate to inform me if you need help in the future!\n\nThanks,\nJamie", "summary": "NONE"}
{"email": "Hi Jennifer,\n\nJosefine here, thank you for your contributions thus far! Keep it up :) I have come down with a bout of flu and have taken sick leave. In lieu of that, could you please prolong the deadline for the business report to next Monday instead?\n\nI will also need you to rearrange the Microsoft Teams sharing which has been planned for tomorrow, much apologies for the inconvenience caused. \n\nLastly, I also understand that the department will be meeting next Wednesday. Can I check that the meeting is about the latest trends? Sorry to trouble you!\n\nCheers!\nJosefine", "summary": "- postpone the meeting scheduled for tomorrow\n- extend deadline for submission of business report due to sick leave\n- confirm that next Wed's meeting agenda is about latest trends "}
{"email": "Cindy,\n\nThank you for meeting me earlier today, as unpleasant the meeting was. Hopefully you will stop calling me all the time now. \n\nTo follow up with what I mentioned earlier, please review the attached business report by tomorrow, since it should not be too difficult. I have also enclosed a file to this email, please complete it and send it back to me by 5 pm this Wednesday.\n\nGood work on being decent at your job so far.\n\nDouglas", "summary": "- review the attached document by tomorrow\n- fill in the attached document by this Wed 5 pm"}
{"email": "Dear Charles,\n\nThis is Raymond, I sat in for the department meeting which you hosted yesterday. Thank you for allowing me to do so, it was an extremely enlightening and fruitful experience.\n\nMy sincere apologies for any additional inconvenience which I may have created for you, as I understand that not everyone was invited to yesterday's meeting.\n\nThank you so much, I am excited to learn more from you and the rest of your team.\n\nWarm Regards,\nRaymond", "summary": "NONE"}
{"email": "Hi Winifred!\n\nThank you for not ignoring the email I sent during the weekend and reading it! Do get back to me with your thoughts on the outline.\n\nMay I ask you to extend the deadline for the submission of the doc? I recently fell and injured my knee and it has been rather inconvenient to do work.\n\nJames also asked me if he could take childcare leave tomorrow, could I please trouble you to accept his request?\n\nCheers!\nJeffrey", "summary": "- give feedback\n- extend deadline for submission of doc due to recent physical injury\n- approve James's request to go on childcare leave"}
{"email": "Hi Karen!\n\nMichael here! I took a look at the recent report by your team, the quality of work is outstanding, great job! Apologies for not meeting your standards for my work, I will strive to do better in the future.\n\nHas the agenda for this Fri's discussion been settled yet? The current plan is to discuss the design review.\n\nI need your help emailing a business report to Melinda, your secretary. I have attached it to this email.\n\nPlease send me a reply by next Monday to let me know that you have received this email!\n\nThanks!\nMichael", "summary": "- acknowledge this email by next Monday\n- forward the document to her secretary\n- confirm that this Fri's meeting agenda is about design review "}
{"email": "Dear Salome,\n\nApologies for missing the last email you sent, I was on sick leave and have been away from work. \n\nMay I ask if it has been confirmed that today's meeting agenda is about our current strategy?\n\nI also feel that our current plan is likely to fail if we continue our current course of action. Shall we postpone this Wed's meeting and take some time to think over our strategy?\n\nThanks,\nAlbert", "summary": "- confirm that today's meeting agenda is about current strategy \n- postpone the meeting scheduled for this Wednesday"}
{"email": "Robert,\n\nIt has been a decent month of working with you so far, keep up your adequate quality of work, please.\n\nI hope that you will be able to continue improving and do a better job in the future.\n\nThanks,\nRegina", "summary": "NONE"}
{"email": "Dear Cindy,\n\nThank you for your assistance during the meeting on Monday. Unfortunately the plan that you suggested is not a very good one, due to our lack of budget and resources.\n\nI will be meeting our client again next week, perhaps you can come up with and share some improvements you have for the proposal.\n\nPlease inform me if you need help next time, there is no points struggling hopelessly.\n\nThanks,\nNorman", "summary": "- give feedback"}
{"email": "Hey Marvin,\n\nGood meeting you just now, it was a really productive discussion! You should stop calling me for non-work reasons thou, otherwise I will \"accidentally\"  miss your future emails :P\n\nFollowing up as we discussed, could you create the Google Meet invitation link for tomorrow 1 pm and send me the invite? I still have no idea how to create a meeting haha.\n\nThanks!\nDan", "summary": "- schedule an online meeting on at 1 pm for tomorrow"}
{"email": "Hi John,\n\nSorry to disturb, I urgently need to inform the client on the progress of the project. Could you write a short status update report and send it over?\n\nAlice reminded me earlier about her request to incrase manpower for her team. I have taken a look at her proposal and everything seems to be in order. Please approve her request as soon as possible.\n\nCould I also trouble you to delay tomorrow's meeting to another date? Since I have more pressing projects to attend to.\n\nThanks!\nAaron", "summary": "- give an update\n- approve Alice's request to increase headcount\n- postpone the meeting scheduled for tomorrow"}
{"email": "Hey Robert!\n\nApologies for the late reply, too many emails have been coming in recently. Regarding the incident yesterday, I would like to apologise for my behaviour, and for causing you trouble.\n\nYes, I have completed the document. I will be attaching the doc to this email, it would be great if you could review it by tomorrow.\n\nHR has sent me an updated copy of intern form. Could I trouble you to forward it to Amanda?\n\nCheers!\nMilton", "summary": "- forward the document to Amanda\n- review the attached document by tomorrow"}
{"email": "Hi Barbara,\n\nThanks for checking in, I am in the midst of executing our plan. Highly appreciate all the effort you have put into the proposal, the quality is truely top notch.\n\nI may not be able to attend the meeting with our client this Thursday, let me get back to you on this. Janice has submitted her request to work from home. Could I trouble you to approve it?\n\nThanks!\nCheryl", "summary": "- approve Janice's request to have work from home arrangement"}
{"email": "Hey Patricia!\n\nThanks for looking through my email and getting back to me! \n\nOur client has requested for us to accelerate our pace, therefore we will need to adjust our schedule accordingly as well. \n\nI have informed the team that there will be a sharing on Zoom at 12 pm tomorrow. Could I trouble you to create and share the link with the team? Please inform me when you have read this message!\n\nCheers,\nJerry", "summary": "- schedule an online meeting on at 12 pm for tomorrow\n- acknowledge this email by tomorrow"}
{"email": "Dear Joshua,\n\nIt has been awhile since I last spoke to you, and I feel that it would be great if we kept each other updated about our progress. I have looked through the proposal you submitted yesterday, and unfortunately, I will be rejecting it as the budget you proposed is unfeasible. \n\nCan I confirm that the department meeting tomorrow is about the team's recent performance? Also, I do not have Andrea's email, hence it would be great if you could assist me in sending the enclosed spreadsheet to her.\n\nThanks!\nDonna", "summary": "- confirm that tomorrow's meeting agenda is about recent performance \n- forward the document to Andrea"}
{"email": "Natasha,\n\nHi there, Whitney here. I would appreciate it if you could check your email more proactively in the future, Jason informs me that you have already missed three emails from him. I do not enjoy giving you criticism hence it would be great if you act on the advice I am giving you.\n\nWith that said, I am extremely busy next week and will be unable to attend the review planned for next Tues. Please inform our client that the meeting will be postponed.\n\nThanks,\nWhitney", "summary": "- postpone the meeting scheduled for next Tuesday"}
{"email": "Hi Tory!\n\nThank you for making time to meet me last week! Apologies for not replying to your follow up earlier, I must have accidentally missed it.\n\nI have finished reviewing the financial report Amanda assigned to me, but I realised that I do not have her email. Could you help me forward it to her please? May I also request for a deadline extension for the doc, as new priorities have been assigned to me?\n\nThank you and I look forward to working with you and your team!\n\nCheers!\nRobert", "summary": "- forward the document to Amanda\n- extend deadline for submission of doc due to new priorities"}
{"email": "Hey John,\n\nGreat work on the recent pitch to our supervisor! The quality of the presentation was really top-notch, and I was very impressed! Appreciate you being able to attend the pitch.\n\nMoving ahead, we will need to start planning the design phase of the project. I will schedule a meeting with you again to discuss this further next week, not this week as new projects have just came in.\n\nCheers!\nMary", "summary": "NONE"}
{"email": "Hi Martha!\n\nThank you for checking in with my progress last week! I apologise for not meeting your expectations and I will strive to do better in the upcoming projects. \n\nI have finished with my assigned work and will be moving on to the review Jonathan has assigned me. \n\nCheers,\nJoseph", "summary": "NONE"}
{"email": "Hi John,\n\nIt was great meeting you! Will need you to review the meeting minutes by tomorrow if that's possible.\n\nI've learnt a lot about our plan for the coming quarter and am excited to work with you and your team to get things started!\n\nMoving ahead, I'd like to meet with you and your team this Wednesday to discuss our next steps. Could you help me schedule a meeting at 4pm?\n\nCheers!\n\nPeter", "summary": "-review the attached document by tomorrow\n- book a meeting at 4 pm next Wednesday"}
{"email": "Hi Georgia,\n\nI am grateful for your help ith the annual report yesterday, but unfortunately the quality was not up to par with what management had expected. Nonetheless, thanks for your help and apologies for the inconvenience due to the last minute request.\n\nI'll need to meet up with you in the future to discuss the plan further, but for now make sure the report reaches the right person.\n\nPeter", "summary": "NONE"}
{"email": "Dear Steven,\n\nI have been really impressed by your work in the recent negotiation. I am really sorry for the mistake that I have made and I will make sure it will not happen again. Thank you so much for helping my solve the mistake and I will always be at your disposal if you need my help.\n\nThank you.\n\nTheresa", "summary": "NONE"}
{"email": "Dear Rose,\n\nSince I am new to the team, I would like to know more about the team members. Hence, I would like you to book a meeting room and arrange for a meeting at 11pm on next Tuesday. Please inform the team members about the meeting. I am looking forward to working with you all.\n\nAllen", "summary": "- book a meeting at 11 pm for next Tues"}
{"email": "Hi David,\n\nI am sorry for the trouble in the meeting yesterday. I really did enjoy the meeting with you a lot.\n\nSincerely,\nAnn", "summary": "NONE"}
{"email": "Dear John,\n\nYour performance has not been up to your standard in the last month. Are you facing any issues? You can talk to me if you are having problems. Also, please postpone the Microsoft Teams discussion on next Wednesday to Friday.\n\nDavid", "summary": "- give feedback\n- postpone the meeting scheduled for next Wed"}
{"email": "Hi Ralph,\n\nCan you please explain more on the recruitment plan that you proposed in the previous meeting? Also, please approve Anita's request to get more manpower as soon as possible. Thank you.\n\nJanet", "summary": "- explain the topic\n- approve Anita's request to get more manpower"}
{"email": "Dear Rosa,\n\nPlease fill in the attached form and send it back to me by this Wednesday 7 am. Also, I will not attend the meeting with you tomorrow because I am sick. Sorry for that!\n\nChristopher", "summary": "- fill in the attached document by this Wednesday 7 am"}
{"email": "Hi Jonathan,\n\nFirst of all, I would like to thank you for helping me during the catchup. However, I had some doubts on the proposal that you sent to me previously. Could you please explain more about it? Last but not least, please fill in the attached form by tomorrow 2 am and send it back to me.\n\nThank you.\n\nPaul", "summary": "- fill in the attached document by tomorrow 2 am\n- explain the topic"}
{"email": "Dear Cheri,\n\nPlease update me the recent status of the project and give further explanations on it. Thank you.\n\nMiesha", "summary": "- give an update\n- explain the topic"}
{"email": "Dear Patricia,\n\nPlease update me on how the project is going now. Also, please help me forward the attached financial report to your team leader. Thank you.\n\nRaymond", "summary": "- give an update\n- forward the document to her team leader"}
{"email": "Hi James,\n\nCould you please approve Michelle's request of paid leave as soon as possible? Thanks a lot!\n\nPeter", "summary": "- approve Michelle's request to go on paid leave"}
{"email": "Dear Lawrence,\n\nCould you tell us what do you think about the previous outcome? Also, I am sorry for asking this but we would like to postpone the deadline for the submission of proposal due to the incident happened this week. Sorry for any inconvenience caused.\n\nLilian", "summary": "- extend deadline for submission of proposal due to unforeseen circumstances\n- give feedback"}
{"email": "Dear Antonio,\n\nI am sorry to say that the project is not up to my expectation. I hope that you would have done a better job next time. Also, please have a look at the attached form by next Friday.\n\nLaura", "summary": "- review the attached document by next Friday"}
{"email": "Dear Angela,\n\nThe plan is already underway. Thank you for not calling me at night.\n\nJennifer", "summary": "NONE"}
{"email": "Hi Barbara,\n\nI could not reach you by phone, hence I am writing this email to you. Could you please prolong the due date for the submission of the proposal for me? This is because I have some family emergency. Please reply to this email by next Thursday. Thank you.\n\nMarilyn", "summary": "- extend deadline for submission of doc due to family emergency\n- acknowledge this email by next Thur"}
{"email": "Dear Lydia,\n\nI am sorry to tell you that the plan might not work. Hence, we would have to redo the planning. Please schedule a Microsoft Teams meeting at 2pm for tomorrow. Also, please give us some feedback on the proposal. Thank you.\n\nSummer", "summary": "- schedule an online meeting on at 2 pm for tomorrow\n- give feedback"}
{"email": "Hi Derek,\n\nI am happy to join you and I am really looking forward to working with everyone in the team. Could you please arrange a discussion session on Slack at 10am on next Wednesday? Also, please submit the attached quotation by tomorrow 7 o'clock in the morning.\n\nThank you.\n\nChantelle", "summary": "- schedule an online meeting on at 10 am for next Wednesday\n- fill in the attached document by tomorrow 7 am"}
{"email": "Dear Yvette,\n\nThere will be other people joining the meeting later.\n\nAnnemarie", "summary": "NONE"}
{"email": "Hi James,\n\nPlease help me extend the deadline for submission of legal contract because of the power outages we are facing in our office. Also, we would like to have an update on the legal process. Thank you.\n\nMartin", "summary": "- extend deadline for submission of legal contract due to power outages\n- give an update"}
{"email": "Dear Christopher,\n\nPlease review the attached Word doc by this Thursday. Also, I would like you to complete the enclosed form and send it back to me by this Thursday 6pm. Help me extend the deadline for proposal submission too!\n\nBob", "summary": "- review the attached document by this Thur\n- extend deadline for submission of proposal due to new priorities\n- fill in the attached document by this Thursday 6 pm"}
{"email": "Email:\nDear Cecile,\n\nI don't understand the content of the report fully, please elaborate more on what you mean. Also, please schedule a discussion in the conference room at 3 pm for next Thursday.\n\nDiana", "summary": "- explain the topic\n- book a meeting at 3 pm for next Thur"}
{"email": "Dear Melinda,\n\nThanks for reading my email! I would like you to delay the review on this Thursday and send a Microsoft Teams invitation at 1am on this Tuesday. Could you also explain more on the upcoming events?\n\nThank you!\n\nGeorge", "summary": "- postpone the meeting scheduled for this Thur\n- schedule an online meeting on at 1 am for this Tuesday\n- explain the topic"}
{"email": "Hi Leah,\n\nPlease approve Lorrie's request to work from home when you are free. Also please forward the draft to David as soon as possible. Let's go out and have a coffee when you have time haha.\n\nJerry", "summary": "- approve Lorrie's request to have work from home arrangement\n- forward the document to David"}
{"email": "Hi Charles,\n\nThe plan that you proposed is awesome. Could you share with us what you think about the plan as well?\n\nSabrina", "summary": "- give feedback"}
{"email": "Dear Sara,\n\nYou should not just drop out of school without any notice. Reply to this email by this Thursday!\n\nKyle", "summary": "- acknowledge this email by this Thu"}
{"email": "Dear Irene,\n\nThank you for following the plan. I am looking forward to hearing from you by this Friday.\n\nChristopher ", "summary": "- acknowledge this email by this Friday"}
{"email": "Dear Alice,\n\nPlease approve Carmen's request for having hybrid work arrangement as soon as possible. Sorry for the inconvenience caused.\n\nCarol", "summary": "- approve Carmen's request to have hybrid work arrangement"}
{"email": "Hi Victor,\n\nJust to confirm that today's sharing agenda is about progress on quarterly goals. Also, please delay the business report submission deadline because I have some urgent matters. Examine the attached document by tomorrow too.\n\nKenneth", "summary": "- extend deadline for submission of business report due to urgent matters\n- confirm that today's meeting agenda is about progress on quarterly goals \n- review the attached document by tomorrow"}
{"email": "Hi Angie,\n\nPlease make sure that tomorrow's sharing agenda is about ongoing projects. Finalize and reply with the enclosed Excel spreadsheet by this Tuesday 11am too as I need it by then. Thanks!\n\nJeffery", "summary": "- confirm that tomorrow's meeting agenda is about ongoing projects \n- fill in the attached document by this Tuesday 11 am"}
{"email": "Hey James,\n\nThank you for giving time for me. I would like you to schedule a discussion on Slack at 9pm tomorrow and let me knkow how things are going. Please reply to this email by today.\n\nJohn", "summary": "- acknowledge this email by today\n- schedule an online meeting on at 9 pm for tomorrow\n- give an update"}
{"email": "Dear Gerald,\n\nYour assistance is really very helpful for me. I would like to confirm with you that we are going to talk about backlog refinement on this Thursday. Also, I would like you to delay the sharing scheduled for next Wednesday. Thank you.\n\nShawn", "summary": "- confirm that this Thu's meeting agenda is about backlog refinement \n- postpone the meeting scheduled for next Wednesday"}
{"email": "Dear Wayne,\n\nWe have to do planning for the project. Please stop procrastinating.\n\nDebra", "summary": "NONE"}
{"email": "Dear Shirley,\n\nThe plan was awesome! Regarding the discussion, I prefer email than meeting.\n\nJanet", "summary": "NONE"}
{"email": "Hi Clarence,\n\nPlease email the spreadsheet to Barbara. You have been doing great on the project. Keep up the good work! \n\nJeremy", "summary": "- forward the document to Barbara"}
{"email": "Hey Matthew,\n\nI can't find you on phone, so I am emailing to you. Please email the spreadsheet to Lee and reply to this email by today.\n\nYolanda", "summary": "- acknowledge this email by today\n- forward the document to Lee"}
{"email": "Hi Nancy,\n\nI am sorry to tell you that your plan cannot be done due to our limited budget. However, you have really done a good job and please keep up the good work! Also, I would like to confirm with you that we will talk about design review on next Wednesday's meeting.\n\nAna", "summary": "- confirm that next Wednesday's meeting agenda is about design review "}
{"email": "Dear Andrew,\n\nPlease review the enclosed form by tomorrow. Thank you and have a good day!\n\nConstance", "summary": "- review the attached document by tomorrow"}
{"email": "Dear Patricia,\n\nPlease let me know how things are going! Also, please review the enclosed document by next Thursday and send it to Ruth. Thank you.\n\nJoseph", "summary": "- give an update\n- review the attached document by next Thur\n- forward the document to Ruth"}
{"email": "Dear Raul,\n\nYour work in the recent negotiation has been brilliant. I really appreciate your time. I am looking forward to learning from you and your team.\n\nCheers!\n\nDaniel", "summary": "NONE"}
{"email": "Dear Armand,\n\nI would like you to postpone the due date for the PDF document submission due to unexpected delays. The meeting with you was quite constructive. Please keep up the good work!\n\nLinda", "summary": "- extend deadline for submission of PDF document due to unexpected delays"}
{"email": "Dear Shane,\n\nThe meeting on next Thursday is cancelled. Please do not hesitate to let me know if you need help. Sorry for that!\n\nLeo", "summary": "NONE"}
{"email": "Dear Raymond,\n\nI know that you are capable of doing better. Please work harder next time!\n\nGabriela", "summary": "NONE"}
{"email": "Hi Howard,\n\nPlease create a Microsoft Teams meeting invitation on this Tuesday at 11pm! The meeting will be about challenges. Also, please approve George's request to go on childcare leave. Thanks!\n\nBrandon", "summary": "- confirm that this Tues's meeting agenda is about challenges \n- schedule an online meeting on at 11 pm for this Tues\n- approve George's request to go on childcare leave"}
{"email": "Dear Armando,\n\nPlease forward the report to Clarence and provide me with an update on the last known development of the project. Also, please send a Google Meet invitation for next Thursday at 10pm. I am looking forward to learning from you and your team.\n\nMelinda", "summary": "- forward the document to Clarence\n- schedule an online meeting on at 10 pm for next Thu\n- give an update"}
{"email": "Hi Darryl,\n\nCan you give more context on the customer feedback? Also, please postpone the timeline for submission of Excel spreadsheet because I have new priorities now. Take a look at the enclosed document by next Friday too!\n\nNorman", "summary": "- extend deadline for submission of Excel spreadsheet due to new priorities\n- review the attached document by next Friday\n- explain the topic"}
{"email": "Dear Betty,\n\nPlease arrange a review in meeting room 2 at 1am for tomorrow. The review agenda will be about product training. Thanks and have a nice day!\n\nBarbara", "summary": "- confirm that tomorrow's meeting agenda is about product training \n- book a meeting at 1 am for tomorrow"}
{"email": "Dear Arthur,\n\nI think you can do better next time! Please submit the contract by 1pm today and I would like to inform you that the Tuesday's meeting will be about ongoing projects. Please update me on the last known progress as well!\n\nJohn", "summary": "- fill in the attached document by today 1 pm\n- confirm that this Tuesday's meeting agenda is about ongoing projects \n- give an update"}
{"email": "Dear Fred,\n\nThank you for your help in the recent spreadsheet. I have really enjoyed working with you. Please let me know when you have received this email by next Monday.\n\nSincerely,\nMark", "summary": "- acknowledge this email by next Mon"}
{"email": "Dear Holly,\n\nCould you give further explanations about what you mean? Also, I would neet to meet with you to discuss about the plan again as your previous plan cannot be proceeded due to budget limitation. Please tell me your availability!\n\nAnna", "summary": "- explain the topic"}
{"email": "Dear Peter,\n\nI am sorry for the mistakes that I have made. I would fix them as soon as possible!\n\nThomas", "summary": "NONE"}
{"email": "Dear Margaret,\n\nI am telling you that your team members will not join the meeting later. Please also fill up the attached financial report by tomorrow 11pm. Thanks!\n\nJennifer", "summary": "- fill in the attached document by tomorrow 11 pm"}
{"email": "Dear Jason, \n\nThank you for applying for the position. \n\nUnfortunately, we regret to inform you that we will not be pursuing your candidacy further for this position. \n\nWe wish you all the best in your future endeavours.\n\nRegards, \nChloe", "summary": "- Reject employment application"}
{"email": "Dear Simon, \n\nCongratulations! You have made it to the final round of interviews for the position of Senior Software Engineer. The interviewers were very impressed and have high expectations for you.\n\nWith that, we would like to invite you for one last interview which would be held at our office this Friday at 2PM. Please confirm your attendance by responding to this email. \n\nIf you are unable to make it at the indicated time, but would still like to attend the interview, please respond to this email with a list of timings that you are available. \n\nWe look forward to hearing your response!\n\nRegards,\nChloe", "summary": "- Congratulate recipient\n- Invite recipient for an interview\n- Require response from recipient"}
{"email": "Hello Dianne,\n\nWelcome to the project. I have heard many good things about you from your previous supervisor, John, and am looking forward to working with you. \n\nI understand that you have not been briefed on your role in the project. To address this, I would like to arrange an online meeting with you sometime next week. \n\nLet me know how that sounds to you!\n\nRegards,\nRaju ", "summary": "- Welcome recipient to the project\n- Arrange a meeting next week\n- Ask for recipient's opinion"}
{"email": "Hello Julia,\n\nI am writing this email to inform you that I will be on leave for one week, starting next Wednesday. \n\nI have temporarily passed my responsibilities on to Ben. Please contact him if you need anything during this period!\n\nRegards,\nEdward", "summary": "- Inform recipient of leave taken for one week\n- Inform recipient of new point of contact "}
{"email": "Dear Zack,\n\nI have some bad news. There has been a critical failure in one of our network security systems yesterday. Fortunately, we were able to minimise the damage done but the CTO has made resolving this issue of utmost importance. \n\nAs part of the team responsible for network security, you are required to attend an emergency meeting later this afternoon. More details of the incident would be shared then. \n\nRegards,\nGina", "summary": "- mention critical failure in network security\n- Inform recipient of meeting later in the day"}
{"email": "Dear Abigail,\n\nThank you for the report on our sales records earlier this week. It was very informative and well done!\n\nIf possible, could you also do up a predictive analysis as well? It would be greatly appreciated!\n\nOnce again, thanks for your great efforts!\n\nRegards,\nSusan", "summary": "- Thank recipient for great work\n- Ask recipient to do work-related task"}
{"email": "Hello Jake,\n\nI am writing this email to request a redo on your recent report. Although you submitted it on time, it was riddled with errors and did not even include some of the sections required.\n\nYou have until this Thursday to get it done.\n\nRegards,\nJoseph", "summary": "- Give negative feedback\n- Redo report by this Thursday"}
{"email": "Hello Gina,\n\nIts good to have you back on the team again. It was really tough not having you in the testing department, no one here is truly as thorough as you are. \n\nFor your information, our meeting timing has changed. Weekly meetings are now every Tuesday at 10:30AM.\n\nSee you soon!\n\nRegards,\nIsabelle", "summary": "- Welcome recipient back\n- Inform recipient of change in meeting time"}
{"email": "Hello Hailey,\n\nI just received a formal complaint regarding your behavior at the function this afternoon, and would like to speak to you about it. \n\nI will be at my office the whole day, just drop by whenever you like.\n\nRegards,\nJason", "summary": "- Talk about complaint received about recipient\n- Request to talk"}
{"email": "Dear Harry,\n\nI heard from Sharon that you will be leaving the company in two weeks time. \n\nIt is truly sad to see you go, not only were you a tremendous help to us, you are also a great friend to many of us in the team. \n\nAll the best in your future endeavours, and please do stay in touch! \n\nRegards,\nTim", "summary": "- Give farewell to recipient"}
{"email": "Dear Mr Tan,\n\nThank you for meeting with me today, it was truly a pleasure talking with you!\n\nI would like to arrange another meeting with you sometime this week to talk about the options available for your insurance plan, is that alright with you?\n\nRegards,\nHarry", "summary": "- Arrange meeting this week"}
{"email": "Dear Johnson,\n\nI heard from Susan that you had some concerns with the project proposal that I presented earlier today. I truly believe in the potential of this project idea and would like to address all the concerns that you might have. \n\nIf possible, could you respond to this email with the issues that you have with the proposal?\n\nRegards,\nLeon", "summary": "- Ask for feedback about project proposal"}
{"email": "Dear Corrine,\n\nThank you for checking in with me. I am currently facing an issue with our company software. It is highly unresponsive whenever I try to enter data into the system. \n\nCould you send some help my way? It would be greatly appreciated!\n\nRegards,\nLuke", "summary": "- Ask for assistance with work"}
{"email": "Dear Rachel,\n\nApologies for my blunder earlier, I had forgotten to attach the report mentioned in my previous email. \n\nHere it is!\n\nRegards,\nKathy", "summary": "- Apologise for forgetting to attach attachment"}
{"email": "Dear Mrs Han,\n\nThe results for your medical check-up last week are out. \n\nOverall, you are in good health! Just remember to eat healthy and stay hydrated. \n\nAttached is your health report in case you are interested in the details.\n\nRegards,\nDr Kimberly", "summary": "- Inform that medical check-up results are out\n- Send health report as attachment"}
{"email": "Dear Veronica,\n\nThank you for your presentation earlier on your project proposal. Unfortunately, while the higher ups loved your idea, we are currently unable to accept it due to financial constraints. \n\nWould it be possible for you to revise some of the budgets allocated?\n\nRegards,\nRon", "summary": "- Give feedback on project proposal\n- Ask for a revision on the project proposal"}
{"email": "Dear Fyonn,\n\nThe CTO is organising a company wide D&D session to celebrate the success of our recent project. Could you kindly confirm your attendance by responding to this email?\n\nRegards,\nThomas", "summary": "- Confirm attendance for D&D event"}
{"email": "Hey Paul,\n\nThis is Dean from IT. \n\nWe recently published our website using the web development frameworks you recommended. The website turned out great and I thought you might want to have a look!\n\nCheers,\nDean", "summary": "NONE"}
{"email": "Hey Steven,\n\nI wanted to follow up with you regarding our previous correspondence. Have you been able to get the information that I requested in my last email?\n\nIn case you forgot, I have copied my previous email below for your reference.\n\nCheers,\nJose", "summary": "- follow up with previous email"}
{"email": "Dear Mr Lim,\n\nI hope all is well. I had fun meeting you and designing our project presentation together last Tuesday. \n\nI know we agreed that I would make a PowerPoint presentation, but I do not have any way to save my work after each session. If possible, could you bring a thumbdrive tomorrow? \n\nRegards,\nDerrick", "summary": "- Ask recipient to bring thumbdrive tomorrow"}
{"email": "Hello Brian,\n\nWe just want to take this opportunity to thank you for choosing us as your company's provider of fire safety equipment and inspections. We are proud of our satisfied clientele and look forward to many years of working together.\n\nYou'll be getting an email soon from your account representative, but if you have any questions in the meantime, you can respond to this email with any enquiries you might have!\n\nThank you again for your business, and have a great day!\n\nRegards,\nLucas", "summary": "- Inform recipient of succesful business transaction"}
{"email": "Hello Naomi,\n\nThank you for lending your assistance in my project. With your help, I am finally able to move on to other items on our backlog. \n\nPlease do let me know if I could be of assistance to you as well!\n\nRegards,\nJames", "summary": "- Thank recipient for assistance\n- Offer assistance if needed"}
{"email": "Good afternoon everyone,\n\nI need to be out of the office on Wednesday, June 28, but I'm still looking for someone to cover my shift that day. If you're interested in swapping shifts with me, please give me a call or respond to this email and we can work something out.\n\nThanks,\nJeffrey ", "summary": "- look for people to swap shifts with"}
{"email": "Dear Johanna,\n\nAs we've recently discussed, your absenteeism is negatively affecting both your individual performance at work and your team's productivity. We take attendance at work seriously and we expect all our employees to comply with our company's policy regarding time off.\n\nThis is your first warning notice. We hope that you will correct your behavior and request time off in advance and in a formal manner. Otherwise, further disciplinary action might be taken.\n\nI'm available to discuss any complications you face that causes your absence at work. Do contact me if there is any way that I could be of help to you!\n\nSincerely,\nTasha", "summary": "- provide negative feedback on workplace behavior\n- give warning notice\n- provide assistance if needed"}
{"email": "Dear Brianna,\n\nI am writing this email to ask if you could help approve my leave request for April. I applied for the leave over two weeks ago but I have yet to receive any confirmation from the HR department.\n\nLet me know if you need anything from my side!\n\nRegards,\nHubert", "summary": "- Ask for assistance in approving time off"}
{"email": "Dear Jonah,\n\nI have noticed that your job performance has been decreasing lately. Not only have you not been meeting job quotas, your teammates have also complained that you do not take your work seriously.\n\nNormally, this would have been grounds for a poor annual work performance review, but I would like to give you a chance to share any issues that you might be facing as in the past your work quality has always been one of the best in the company.\n\nI hope to hear from you soon!\n\nSincerely,\nHarvey", "summary": "- Provide negative feedback on work performance\n- Ask recipient to share issues that he might be facing"}
{"email": "Hey Rudy,\n\nI read from your previous email that you would like to hold a meeting with the team on Tuesday. However, you did not indicate an agenda for the meeting, nor the things to prepare.\n\nCould you revise the details and send another invitation over?\n\nSincerely,\nChloe", "summary": "- Ask for more details regarding the meeting"}
{"email": "Dear Steve,\n\nI am writing this email to recommend Peter for the role as Tech Lead. I have worked with him closely for the last two years and have no doubt of his capabilities in the field of robotics.\n\nHe has always put a premium on timeliness and throughness among my team members and he has never failed to deliver. \n\nI truly believe that he has what it takes.\n\nSincerely,\nJay", "summary": "- Recommend co-worker for promotion"}
{"email": "Hello Dion,\n\nAs you may already know, there has been a few cases of COVID-19 in the office recently. Upper management has asked me to inform you to work from home if possible, and only come to the office if its necessary. \n\nThank you for your efforts during this trying time!\n\nSincerely,\nKelly", "summary": "- Inform recipient of new office measures"}
{"email": "Hello Mr Koh,\n\nThank you for reaching out. I definitely understand your concern and I am escalating your issues so that someone else can take a closer look at what is going on.\n\nOne of my team mates will be in contact with you in the next few days. \n\nSincerely,\nVinny", "summary": "- Inform recipient of a contact in the next few days"}
