{"email": "Dear James,\n\nI had an enjoyable meeting with you and I look forward to working together in future projects! However, please refrain from contacting me without any purpose.\n\n Unfortunately, your plan cannot proceed due to our limited budget.\n\nRegards, Christopher", "summary": "NONE"}
{"email": "Marshall,\n\nThanks for attending the meeting last week, glad that you followed our plan as discussed. Can you be more in depth about what you mean, and explain the topic to me? The call was not good at all. Can you also rearrange the Slack review happening next Wed, and check that the agenda next Tues's review is about design review?\n\nThanks, Lauri", "summary": "- confirm that next Tues's meeting agenda is about design review\n\n- explain the topic\n\n- postpone the meeting scheduled for next Wed"}
{"email": "Hey Kurt,\n\nThanks for the great catchup yesterday, it was a good idea to meet up! As spoken, do keep me updated on the current status of the project.\n\nBy the way, I have been feeling stressful recently and I would appreciate if you could cause me less grief.\n\n Cheers! Mildred", "summary": "-give an update"}
{"email": "Hi Michael,\n\nHere to check in about the plan, unfortunately, it cannot be done due to time constraints. I would like to meet up to discuss about the next steps of the plan.\n\nMay I trouble you to send a Skype invitation for the 10am meeting tomorrow? I will also need you to finish up the report by next Thu 10 pm. I have attached it to this email.\n\n Thank you so much! Cheers, Patsy", "summary": "- schedule an online meeting on at 10 am for tomorrow\n\n- fill in the attached document by next Thu 10 pm"}
{"email": "Louise,\n\nGood conversation, but can you re-explain the goals for next quarter? Also, do I always need to remind you to read your email? Your performance so far has been reflecting badly on your work standards!\n\nGood work rescheduling the meeting. Please confirm if today's chat agenda is about the company's company on this quarterly's goals.\n\nThanks,\nRandy\n\n", "summary": "- confirm that today's meeting agenda is about progress on quarterly goals \n- explain the topic"}
