{"email": "Dear James,\n\nI had an enjoyable meeting with you and I look forward to working together in future projects! However, please refrain from contacting me without any purpose.\n\n Unfortunately, your plan cannot proceed due to our limited budget.\n\nRegards, Christopher", "summary": "NONE"}
{"email": "Marshall,\n\nThanks for attending the meeting last week, glad that you followed our plan as discussed. Can you be more in depth about what you mean, and explain the topic to me? The call was not good at all. Can you also rearrange the Slack review happening next Wed, and check that the agenda next Tues's review is about design review?\n\nThanks, Lauri", "summary": "- confirm that next Tues's meeting agenda is about design review\n- explain the topic\n- postpone the meeting scheduled for next Wed"}
{"email": "Hey Kurt,\n\nThanks for the great catchup yesterday, it was a good idea to meet up! As spoken, do keep me updated on the current status of the project.\n\nBy the way, I have been feeling stressful recently and I would appreciate if you could cause me less grief.\n\n Cheers! Mildred", "summary": "- give an update"}
{"email": "Hi Michael,\n\nHere to check in about the plan, unfortunately, it cannot be done due to time constraints. I would like to meet up to discuss about the next steps of the plan.\n\nMay I trouble you to send a Skype invitation for the 10am meeting tomorrow? I will also need you to finish up the report by next Thu 10 pm. I have attached it to this email.\n\n Thank you so much! Cheers, Patsy", "summary": "- schedule an online meeting on at 10 am for tomorrow\n- fill in the attached document by next Thu 10 pm"}
{"email": "Louise,\n\nGood conversation, but can you re-explain the goals for next quarter? Also, do I always need to remind you to read your email? Your performance so far has been reflecting badly on your work standards!\n\nGood work rescheduling the meeting. Please confirm if today's chat agenda is about the company's company on this quarterly's goals.\n\nThanks,\nRandy", "summary": "- confirm that today's meeting agenda is about progress on quarterly goals\n- explain the topic"}
{"email": "Hi Randall!\n\nIt's nice to meet you, I have recently joined your team. I sincerely apologise for not performing my role up to par.\n\nWarm Regards,\nPatricia", "summary": "NONE"}
{"email": "Hi Tim!\n\nFirstly, I would like to apologise for the inconvenience I have caused. Thank you so much for rearranging the meeting, I highly value you help.\n\nUnfortunately, your approach is unlike the one we discussed previously. I would appreciate if you do not deviate from the initial plan.\n\nThanks,\nAndrew", "summary": "NONE"}
{"email": "Hey Tiffany!\n\nApologies for not replying earlier, I have an enormous amount of emails to go through everyday. We went off topic many times during the meeting the other day, hopefully we can be more productive in the future.\n\nThank you for not disregarding me the other day, I am excited to work with you on future projects!\n\nCheers!\nRobert", "summary": "NONE"}
{"email": "Dear Alana\n\nNice to meet you, I am new to the company and I have the pleasure of joining your team!\n\nSorry to trouble you, but could you assist in scheduling a review session next Tuesday? 4pm would be great!\n\nThank you!\nDana", "summary": "- book a meeting at 4 pm for next Tues"}
{"email": "Matthew,\n\nThis is an urgent email, please reply to acknowledge that you have received this email by today.\n\nGood work assisting me during the catchup, just as I expected of you. I have some new tasks for you, can you approve George's hybrid work arrangement request? Can you also postpone the Slack sharing planned for this Thursday?\n\nPlease note that I would prefer correspondence via email rather than meeting, whether physically or online.\n\nColin", "summary": "- postpone the meeting scheduled for this Thur\n- acknowledge this email by today\n- approve George's request to have hybrid work arrangement"}
{"email": "Dear Tina,\n\nAlyssa here, I am a new employee and I will be a part of your team. I am sorry for causing inconvenience the other day, please accept my apology.\n\nExcited to work with you.\n\nRegards,\nAlyssa", "summary": "NONE"}
{"email": "Hi Kenneth,\n\nJust a heads up, I am not familiar with the topic, so I might not be going for the discussion with you. \n\nMay I trouble you to help me with some tasks? Please email the attached spreadsheet to Elizabeth, preferably by today. Also, other projects with higher priorities have just come in, so I would appreciate it if you could delay the submission of the diagram.\n\nThanks!\nHerbert", "summary": "- extend deadline for submission of diagram due to new priorities\n- forward the document to Elizabeth"}
{"email": "Hey Octavio,\n\nI am sincerely sorry for the sub-par work submitted, I have been facing some personal issues. Just to follow up, the quality of discussion of the call yesterday could be improved, it was not enjoyable at all.\n\nCheers,\nJeffrey", "summary": "NONE"}
{"email": "Hi Dana!\n\nAfter our catchup last Friday, I now understand you better and am looking forward to working with you! Could you let me know what you think about the upcoming project?\n\nOne last thing, unfortunately, I may not be able to make it for the meeting with you next week. Is it possible to reschedule? Thanks!\n\nCheers!\nShirley", "summary": "- give feedback"}
{"email": "Hey Gregory,\n\nI have been busy recently, and it would be great if you do not contact me without a good reason. Thank you for letting me shadow you yesterday, I learnt a lot from you.\n\nCould I trouble you to read the email I sent you yesterday? I need you to prolong the deadline for the submission of the PDF document as new priorities have just came in.\n\nLet me know when you have done so.\n\nCheers!\nBeverly", "summary": "- extend deadline for submission of PDF document due to new priorities"}
{"email": "Hi Fred!\n\nI had a wonderful time meeting you last Wednesday! I would prefer being contacted through email about work information thou. I have attached a PDF document to this email, could you complete it and send it back to me by 8 pm tomorrow?\n\nPlease send a copy to Eric as well. May I also check that the agenda for this Thurs' meeting is about the company's performance recently?\n\nThanks,\nMariann", "summary": "- fill in the attached document by tomorrow 8 pm\n- confirm that this Thursday's meeting agenda is about recent performance \n- forward the document to Eric"}
{"email": "Hey Juli!\n\nThanks for the call yesterday, it was really great! Unfortunately, I am writing this email to let you know that your negotiation with the partner company was sub-par and I expected more from you.\n\nPlease do not hesitate to inform me if you need help in the future!\n\nThanks,\nJamie", "summary": "NONE"}
{"email": "Hi Jennifer,\n\nJosefine here, thank you for your contributions thus far! Keep it up :) I have come down with a bout of flu and have taken sick leave. In lieu of that, could you please prolong the deadline for the business report to next Monday instead?\n\nI will also need you to rearrange the Microsoft Teams sharing which has been planned for tomorrow, much apologies for the inconvenience caused. \n\nLastly, I also understand that the department will be meeting next Wednesday. Can I check that the meeting is about the latest trends? Sorry to trouble you!\n\nCheers!\nJosefine", "summary": "- postpone the meeting scheduled for tomorrow\n- extend deadline for submission of business report due to sick leave\n- confirm that next Wed's meeting agenda is about latest trends "}
{"email": "Cindy,\n\nThank you for meeting me earlier today, as unpleasant the meeting was. Hopefully you will stop calling me all the time now. \n\nTo follow up with what I mentioned earlier, please review the attached business report by tomorrow, since it should not be too difficult. I have also enclosed a file to this email, please complete it and send it back to me by 5 pm this Wednesday.\n\nGood work on being decent at your job so far.\n\nDouglas", "summary": "- review the attached document by tomorrow\n- fill in the attached document by this Wed 5 pm"}
{"email": "Dear Charles,\n\nThis is Raymond, I sat in for the department meeting which you hosted yesterday. Thank you for allowing me to do so, it was an extremely enlightening and fruitful experience.\n\nMy sincere apologies for any additional inconvenience which I may have created for you, as I understand that not everyone was invited to yesterday's meeting.\n\nThank you so much, I am excited to learn more from you and the rest of your team.\n\nWarm Regards,\nRaymond", "summary": "NONE"}
{"email": "Hi Winifred!\n\nThank you for not ignoring the email I sent during the weekend and reading it! Do get back to me with your thoughts on the outline.\n\nMay I ask you to extend the deadline for the submission of the doc? I recently fell and injured my knee and it has been rather inconvenient to do work.\n\nJames also asked me if he could take childcare leave tomorrow, could I please trouble you to accept his request?\n\nCheers!\nJeffrey", "summary": "- give feedback\n- extend deadline for submission of doc due to recent physical injury\n- approve James's request to go on childcare leave"}
{"email": "Hi Karen!\n\nMichael here! I took a look at the recent report by your team, the quality of work is outstanding, great job! Apologies for not meeting your standards for my work, I will strive to do better in the future.\n\nHas the agenda for this Fri's discussion been settled yet? The current plan is to discuss the design review.\n\nI need your help emailing a business report to Melinda, your secretary. I have attached it to this email.\n\nPlease send me a reply by next Monday to let me know that you have received this email!\n\nThanks!\nMichael", "summary": "- acknowledge this email by next Monday\n- forward the document to her secretary\n- confirm that this Fri's meeting agenda is about design review "}
{"email": "Dear Salome,\n\nApologies for missing the last email you sent, I was on sick leave and have been away from work. \n\nMay I ask if it has been confirmed that today's meeting agenda is about our current strategy?\n\nI also feel that our current plan is likely to fail if we continue our current course of action. Shall we postpone this Wed's meeting and take some time to think over our strategy?\n\nThanks,\nAlbert", "summary": "- confirm that today's meeting agenda is about current strategy \n- postpone the meeting scheduled for this Wednesday"}
{"email": "Robert,\n\nIt has been a decent month of working with you so far, keep up your adequate quality of work, please.\n\nI hope that you will be able to continue improving and do a better job in the future.\n\nThanks,\nRegina", "summary": "NONE"}
{"email": "Dear Cindy,\n\nThank you for your assistance during the meeting on Monday. Unfortunately the plan that you suggested is not a very good one, due to our lack of budget and resources.\n\nI will be meeting our client again next week, perhaps you can come up with and share some improvements you have for the proposal.\n\nPlease inform me if you need help next time, there is no points struggling hopelessly.\n\nThanks,\nNorman", "summary": "- give feedback"}
{"email": "Hey Marvin,\n\nGood meeting you just now, it was a really productive discussion! You should stop calling me for non-work reasons thou, otherwise I will \"accidentally\"  miss your future emails :P\n\nFollowing up as we discussed, could you create the Google Meet invitation link for tomorrow 1 pm and send me the invite? I still have no idea how to create a meeting haha.\n\nThanks!\nDan", "summary": "- schedule an online meeting on at 1 pm for tomorrow"}
{"email": "Hi John,\n\nSorry to disturb, I urgently need to inform the client on the progress of the project. Could you write a short status update report and send it over?\n\nAlice reminded me earlier about her request to incrase manpower for her team. I have taken a look at her proposal and everything seems to be in order. Please approve her request as soon as possible.\n\nCould I also trouble you to delay tomorrow's meeting to another date? Since I have more pressing projects to attend to.\n\nThanks!\nAaron", "summary": "- give an update\n- approve Alice's request to increase headcount\n- postpone the meeting scheduled for tomorrow"}
{"email": "Hey Robert!\n\nApologies for the late reply, too many emails have been coming in recently. Regarding the incident yesterday, I would like to apologise for my behaviour, and for causing you trouble.\n\nYes, I have completed the document. I will be attaching the doc to this email, it would be great if you could review it by tomorrow.\n\nHR has sent me an updated copy of intern form. Could I trouble you to forward it to Amanda?\n\nCheers!\nMilton", "summary": "- forward the document to Amanda\n- review the attached document by tomorrow"}
{"email": "Hi Barbara,\n\nThanks for checking in, I am in the midst of executing our plan. Highly appreciate all the effort you have put into the proposal, the quality is truely top notch.\n\nI may not be able to attend the meeting with our client this Thursday, let me get back to you on this. Janice has submitted her request to work from home. Could I trouble you to approve it?\n\nThanks!\nCheryl", "summary": "- approve Janice's request to have work from home arrangement"}
{"email": "Hey Patricia!\n\nThanks for looking through my email and getting back to me! \n\nOur client has requested for us to accelerate our pace, therefore we will need to adjust our schedule accordingly as well. \n\nI have informed the team that there will be a sharing on Zoom at 12 pm tomorrow. Could I trouble you to create and share the link with the team? Please inform me when you have read this message!\n\nCheers,\nJerry", "summary": "- schedule an online meeting on at 12 pm for tomorrow\n- acknowledge this email by tomorrow"}
{"email": "Dear Joshua,\n\nIt has been awhile since I last spoke to you, and I feel that it would be great if we kept each other updated about our progress. I have looked through the proposal you submitted yesterday, and unfortunately, I will be rejecting it as the budget you proposed is unfeasible. \n\nCan I confirm that the department meeting tomorrow is about the team's recent performance? Also, I do not have Andrea's email, hence it would be great if you could assist me in sending the enclosed spreadsheet to her.\n\nThanks!\nDonna", "summary": "- confirm that tomorrow's meeting agenda is about recent performance \n- forward the document to Andrea"}
{"email": "Natasha,\n\nHi there, Whitney here. I would appreciate it if you could check your email more proactively in the future, Jason informs me that you have already missed three emails from him. I do not enjoy giving you criticism hence it would be great if you act on the advice I am giving you.\n\nWith that said, I am extremely busy next week and will be unable to attend the review planned for next Tues. Please inform our client that the meeting will be postponed.\n\nThanks,\nWhitney", "summary": "- postpone the meeting scheduled for next Tuesday"}
{"email": "Hi Tory!\n\nThank you for making time to meet me last week! Apologies for not replying to your follow up earlier, I must have accidentally missed it.\n\nI have finished reviewing the financial report Amanda assigned to me, but I realised that I do not have her email. Could you help me forward it to her please? May I also request for a deadline extension for the doc, as new priorities have been assigned to me?\n\nThank you and I look forward to working with you and your team!\n\nCheers!\nRobert", "summary": "- forward the document to Amanda\n- extend deadline for submission of doc due to new priorities"}
{"email": "Hey John,\n\nGreat work on the recent pitch to our supervisor! The quality of the presentation was really top-notch, and I was very impressed! Appreciate you being able to attend the pitch.\n\nMoving ahead, we will need to start planning the design phase of the project. I will schedule a meeting with you again to discuss this further next week, not this week as new projects have just came in.\n\nCheers!\nMary", "summary": "NONE"}
{"email": "Hi Martha!\n\nThank you for checking in with my progress last week! I apologise for not meeting your expectations and I will strive to do better in the upcoming projects. \n\nI have finished with my assigned work and will be moving on to the review Jonathan has assigned me. \n\nCheers,\nJoseph", "summary": "NONE"}
