{"email": "Dear Steven,\n\nI have been really impressed by your work in the recent negotiation. I am really sorry for the mistake that I have made and I will make sure it will not happen again. Thank you so much for helping my solve the mistake and I will always be at your disposal if you need my help.\n\nThank you.\n\nTheresa", "summary": "NONE"}
{"email": "Dear Rose,\n\nSince I am new to the team, I would like to know more about the team members. Hence, I would like you to book a meeting room and arrange for a meeting at 11pm on next Tuesday. Please inform the team members about the meeting. I am looking forward to working with you all.\n\nAllen", "summary": "- book a meeting at 11 pm for next Tues"}
{"email": "Hi David,\n\nI am sorry for the trouble in the meeting yesterday. I really did enjoy the meeting with you a lot.\n\nSincerely,\nAnn", "summary": "NONE"}
{"email": "Dear John,\n\nYour performance has not been up to your standard in the last month. Are you facing any issues? You can talk to me if you are having problems. Also, please postpone the Microsoft Teams discussion on next Wednesday to Friday.\n\nDavid", "summary": "- give feedback\n- postpone the meeting scheduled for next Wed"}
{"email": "Hi Ralph,\n\nCan you please explain more on the recruitment plan that you proposed in the previous meeting? Also, please approve Anita's request to get more manpower as soon as possible. Thank you.\n\nJanet", "summary": "- explain the topic\n- approve Anita's request to get more manpower"}
{"email": "Dear Rosa,\n\nPlease fill in the attached form and send it back to me by this Wednesday 7 am. Also, I will not attend the meeting with you tomorrow because I am sick. Sorry for that!\n\nChristopher", "summary": "- fill in the attached document by this Wednesday 7 am"}
{"email": "Hi Jonathan,\n\nFirst of all, I would like to thank you for helping me during the catchup. However, I had some doubts on the proposal that you sent to me previously. Could you please explain more about it? Last but not least, please fill in the attached form by tomorrow 2 am and send it back to me.\n\nThank you.\n\nPaul", "summary": "- fill in the attached document by tomorrow 2 am\n- explain the topic"}
{"email": "Dear Cheri,\n\nPlease update me the recent status of the project and give further explanations on it. Thank you.\n\nMiesha", "summary": "- give an update\n- explain the topic"}
{"email": "Dear Patricia,\n\nPlease update me on how the project is going now. Also, please help me forward the attached financial report to your team leader. Thank you.\n\nRaymond", "summary": "- give an update\n- forward the document to her team leader"}
{"email": "Hi James,\n\nCould you please approve Michelle's request of paid leave as soon as possible? Thanks a lot!\n\nPeter", "summary": "- approve Michelle's request to go on paid leave"}
{"email": "Dear Lawrence,\n\nCould you tell us what do you think about the previous outcome? Also, I am sorry for asking this but we would like to postpone the deadline for the submission of proposal due to the incident happened this week. Sorry for any inconvenience caused.\n\nLilian", "summary": "- extend deadline for submission of proposal due to unforeseen circumstances\n- give feedback"}
{"email": "Dear Antonio,\n\nI am sorry to say that the project is not up to my expectation. I hope that you would have done a better job next time. Also, please have a look at the attached form by next Friday.\n\nLaura", "summary": "- review the attached document by next Friday"}
{"email": "Dear Angela,\n\nThe plan is already underway. Thank you for not calling me at night.\n\nJennifer", "summary": "NONE"}
{"email": "Hi Barbara,\n\nI could not reach you by phone, hence I am writing this email to you. Could you please prolong the due date for the submission of the proposal for me? This is because I have some family emergency. Please reply to this email by next Thursday. Thank you.\n\nMarilyn", "summary": "- extend deadline for submission of doc due to family emergency\n- acknowledge this email by next Thur"}
{"email": "Dear Lydia,\n\nI am sorry to tell you that the plan might not work. Hence, we would have to redo the planning. Please schedule a Microsoft Teams meeting at 2pm for tomorrow. Also, please give us some feedback on the proposal. Thank you.\n\nSummer", "summary": "- schedule an online meeting on at 2 pm for tomorrow\n- give feedback"}
{"email": "Hi Derek,\n\nI am happy to join you and I am really looking forward to working with everyone in the team. Could you please arrange a discussion session on Slack at 10am on next Wednesday? Also, please submit the attached quotation by tomorrow 7 o'clock in the morning.\n\nThank you.\n\nChantelle", "summary": "- schedule an online meeting on at 10 am for next Wednesday\n- fill in the attached document by tomorrow 7 am"}
{"email": "Dear Yvette,\n\nThere will be other people joining the meeting later.\n\nAnnemarie", "summary": "NONE"}
{"email": "Hi James,\n\nPlease help me extend the deadline for submission of legal contract because of the power outages we are facing in our office. Also, we would like to have an update on the legal process. Thank you.\n\nMartin", "summary": "- extend deadline for submission of legal contract due to power outages\n- give an update"}
{"email": "Dear Christopher,\n\nPlease review the attached Word doc by this Thursday. Also, I would like you to complete the enclosed form and send it back to me by this Thursday 6pm. Help me extend the deadline for proposal submission too!\n\nBob", "summary": "- review the attached document by this Thur\n- extend deadline for submission of proposal due to new priorities\n- fill in the attached document by this Thursday 6 pm"}
{"email": "Email:\nDear Cecile,\n\nI don't understand the content of the report fully, please elaborate more on what you mean. Also, please schedule a discussion in the conference room at 3 pm for next Thursday.\n\nDiana", "summary": "- explain the topic\n- book a meeting at 3 pm for next Thur"}
{"email": "Dear Melinda,\n\nThanks for reading my email! I would like you to delay the review on this Thursday and send a Microsoft Teams invitation at 1am on this Tuesday. Could you also explain more on the upcoming events?\n\nThank you!\n\nGeorge", "summary": "- postpone the meeting scheduled for this Thur\n- schedule an online meeting on at 1 am for this Tuesday\n- explain the topic"}
{"email": "Hi Leah,\n\nPlease approve Lorrie's request to work from home when you are free. Also please forward the draft to David as soon as possible. Let's go out and have a coffee when you have time haha.\n\nJerry", "summary": "- approve Lorrie's request to have work from home arrangement\n- forward the document to David"}
{"email": "Hi Charles,\n\nThe plan that you proposed is awesome. Could you share with us what you think about the plan as well?\n\nSabrina", "summary": "- give feedback"}
{"email": "Dear Sara,\n\nYou should not just drop out of school without any notice. Reply to this email by this Thursday!\n\nKyle", "summary": "- acknowledge this email by this Thu"}
{"email": "Dear Irene,\n\nThank you for following the plan. I am looking forward to hearing from you by this Friday.\n\nChristopher ", "summary": "- acknowledge this email by this Friday"}
{"email": "Dear Alice,\n\nPlease approve Carmen's request for having hybrid work arrangement as soon as possible. Sorry for the inconvenience caused.\n\nCarol", "summary": "- approve Carmen's request to have hybrid work arrangement"}
{"email": "Hi Victor,\n\nJust to confirm that today's sharing agenda is about progress on quarterly goals. Also, please delay the business report submission deadline because I have some urgent matters. Examine the attached document by tomorrow too.\n\nKenneth", "summary": "- extend deadline for submission of business report due to urgent matters\n- confirm that today's meeting agenda is about progress on quarterly goals \n- review the attached document by tomorrow"}
{"email": "Hi Angie,\n\nPlease make sure that tomorrow's sharing agenda is about ongoing projects. Finalize and reply with the enclosed Excel spreadsheet by this Tuesday 11am too as I need it by then. Thanks!\n\nJeffery", "summary": "- confirm that tomorrow's meeting agenda is about ongoing projects \n- fill in the attached document by this Tuesday 11 am"}
{"email": "Hey James,\n\nThank you for giving time for me. I would like you to schedule a discussion on Slack at 9pm tomorrow and let me knkow how things are going. Please reply to this email by today.\n\nJohn", "summary": "- acknowledge this email by today\n- schedule an online meeting on at 9 pm for tomorrow\n- give an update"}
{"email": "Dear Gerald,\n\nYour assistance is really very helpful for me. I would like to confirm with you that we are going to talk about backlog refinement on this Thursday. Also, I would like you to delay the sharing scheduled for next Wednesday. Thank you.\n\nShawn", "summary": "- confirm that this Thu's meeting agenda is about backlog refinement \n- postpone the meeting scheduled for next Wednesday"}
{"email": "Dear Wayne,\n\nWe have to do planning for the project. Please stop procrastinating.\n\nDebra", "summary": "NONE"}
{"email": "Dear Shirley,\n\nThe plan was awesome! Regarding the discussion, I prefer email than meeting.\n\nJanet", "summary": "NONE"}
{"email": "Hi Clarence,\n\nPlease email the spreadsheet to Barbara. You have been doing great on the project. Keep up the good work! \n\nJeremy", "summary": "- forward the document to Barbara"}
{"email": "Hey Matthew,\n\nI can't find you on phone, so I am emailing to you. Please email the spreadsheet to Lee and reply to this email by today.\n\nYolanda", "summary": "- acknowledge this email by today\n- forward the document to Lee"}
{"email": "Hi Nancy,\n\nI am sorry to tell you that your plan cannot be done due to our limited budget. However, you have really done a good job and please keep up the good work! Also, I would like to confirm with you that we will talk about design review on next Wednesday's meeting.\n\nAna", "summary": "- confirm that next Wednesday's meeting agenda is about design review "}
{"email": "Dear Andrew,\n\nPlease review the enclosed form by tomorrow. Thank you and have a good day!\n\nConstance", "summary": "- review the attached document by tomorrow"}
{"email": "Dear Patricia,\n\nPlease let me know how things are going! Also, please review the enclosed document by next Thursday and send it to Ruth. Thank you.\n\nJoseph", "summary": "- give an update\n- review the attached document by next Thur\n- forward the document to Ruth"}
{"email": "Dear Raul,\n\nYour work in the recent negotiation has been brilliant. I really appreciate your time. I am looking forward to learning from you and your team.\n\nCheers!\n\nDaniel", "summary": "NONE"}
{"email": "Dear Armand,\n\nI would like you to postpone the due date for the PDF document submission due to unexpected delays. The meeting with you was quite constructive. Please keep up the good work!\n\nLinda", "summary": "- extend deadline for submission of PDF document due to unexpected delays"}
{"email": "Dear Shane,\n\nThe meeting on next Thursday is cancelled. Please do not hesitate to let me know if you need help. Sorry for that!\n\nLeo", "summary": "NONE"}
{"email": "Dear Raymond,\n\nI know that you are capable of doing better. Please work harder next time!\n\nGabriela", "summary": "NONE"}
{"email": "Hi Howard,\n\nPlease create a Microsoft Teams meeting invitation on this Tuesday at 11pm! The meeting will be about challenges. Also, please approve George's request to go on childcare leave. Thanks!\n\nBrandon", "summary": "- confirm that this Tues's meeting agenda is about challenges \n- schedule an online meeting on at 11 pm for this Tues\n- approve George's request to go on childcare leave"}
{"email": "Dear Armando,\n\nPlease forward the report to Clarence and provide me with an update on the last known development of the project. Also, please send a Google Meet invitation for next Thursday at 10pm. I am looking forward to learning from you and your team.\n\nMelinda", "summary": "- forward the document to Clarence\n- schedule an online meeting on at 10 pm for next Thu\n- give an update"}
{"email": "Hi Darryl,\n\nCan you give more context on the customer feedback? Also, please postpone the timeline for submission of Excel spreadsheet because I have new priorities now. Take a look at the enclosed document by next Friday too!\n\nNorman", "summary": "- extend deadline for submission of Excel spreadsheet due to new priorities\n- review the attached document by next Friday\n- explain the topic"}
{"email": "Dear Betty,\n\nPlease arrange a review in meeting room 2 at 1am for tomorrow. The review agenda will be about product training. Thanks and have a nice day!\n\nBarbara", "summary": "- confirm that tomorrow's meeting agenda is about product training \n- book a meeting at 1 am for tomorrow"}
{"email": "Dear Arthur,\n\nI think you can do better next time! Please submit the contract by 1pm today and I would like to inform you that the Tuesday's meeting will be about ongoing projects. Please update me on the last known progress as well!\n\nJohn", "summary": "- fill in the attached document by today 1 pm\n- confirm that this Tuesday's meeting agenda is about ongoing projects \n- give an update"}
{"email": "Dear Fred,\n\nThank you for your help in the recent spreadsheet. I have really enjoyed working with you. Please let me know when you have received this email by next Monday.\n\nSincerely,\nMark", "summary": "- acknowledge this email by next Mon"}
{"email": "Dear Holly,\n\nCould you give further explanations about what you mean? Also, I would neet to meet with you to discuss about the plan again as your previous plan cannot be proceeded due to budget limitation. Please tell me your availability!\n\nAnna", "summary": "- explain the topic"}
{"email": "Dear Peter,\n\nI am sorry for the mistakes that I have made. I would fix them as soon as possible!\n\nThomas", "summary": "NONE"}
{"email": "Dear Margaret,\n\nI am telling you that your team members will not join the meeting later. Please also fill up the attached financial report by tomorrow 11pm. Thanks!\n\nJennifer", "summary": "- fill in the attached document by tomorrow 11 pm"}
