{"email": "Dear Jason, \n\nThank you for applying for the position. \n\nUnfortunately, we regret to inform you that we will not be pursuing your candidacy further for this position. \n\nWe wish you all the best in your future endeavours.\n\nRegards, \nChloe", "summary": "- Reject employment application"}
{"email": "Dear Simon, \n\nCongratulations! You have made it to the final round of interviews for the position of Senior Software Engineer. The interviewers were very impressed and have high expectations for you.\n\nWith that, we would like to invite you for one last interview which would be held at our office this Friday at 2PM. Please confirm your attendance by responding to this email. \n\nIf you are unable to make it at the indicated time, but would still like to attend the interview, please respond to this email with a list of timings that you are available. \n\nWe look forward to hearing your response!\n\nRegards,\nChloe", "summary": "- Congratulate recipient\n- Invite recipient for an interview\n- Require response from recipient"}
{"email": "Hello Dianne,\n\nWelcome to the project. I have heard many good things about you from your previous supervisor, John, and am looking forward to working with you. \n\nI understand that you have not been briefed on your role in the project. To address this, I would like to arrange an online meeting with you sometime next week. \n\nLet me know how that sounds to you!\n\nRegards,\nRaju ", "summary": "- Welcome recipient to the project\n- Arrange a meeting next week\n- Ask for recipient's opinion"}
{"email": "Hello Julia,\n\nI am writing this email to inform you that I will be on leave for one week, starting next Wednesday. \n\nI have temporarily passed my responsibilities on to Ben. Please contact him if you need anything during this period!\n\nRegards,\nEdward", "summary": "- Inform recipient of leave taken for one week\n- Inform recipient of new point of contact "}
{"email": "Dear Zack,\n\nI have some bad news. There has been a critical failure in one of our network security systems yesterday. Fortunately, we were able to minimise the damage done but the CTO has made resolving this issue of utmost importance. \n\nAs part of the team responsible for network security, you are required to attend an emergency meeting later this afternoon. More details of the incident would be shared then. \n\nRegards,\nGina", "summary": "- mention critical failure in network security\n- Inform recipient of meeting later in the day"}
{"email": "Dear Abigail,\n\nThank you for the report on our sales records earlier this week. It was very informative and well done!\n\nIf possible, could you also do up a predictive analysis as well? It would be greatly appreciated!\n\nOnce again, thanks for your great efforts!\n\nRegards,\nSusan", "summary": "- Thank recipient for great work\n- Ask recipient to do work-related task"}
{"email": "Hello Jake,\n\nI am writing this email to request a redo on your recent report. Although you submitted it on time, it was riddled with errors and did not even include some of the sections required.\n\nYou have until this Thursday to get it done.\n\nRegards,\nJoseph", "summary": "- Give negative feedback\n- Redo report by this Thursday"}
{"email": "Hello Gina,\n\nIts good to have you back on the team again. It was really tough not having you in the testing department, no one here is truly as thorough as you are. \n\nFor your information, our meeting timing has changed. Weekly meetings are now every Tuesday at 10:30AM.\n\nSee you soon!\n\nRegards,\nIsabelle", "summary": "- Welcome recipient back\n- Inform recipient of change in meeting time"}
{"email": "Hello Hailey,\n\nI just received a formal complaint regarding your behavior at the function this afternoon, and would like to speak to you about it. \n\nI will be at my office the whole day, just drop by whenever you like.\n\nRegards,\nJason", "summary": "- Talk about complaint received about recipient\n- Request to talk"}
{"email": "Dear Harry,\n\nI heard from Sharon that you will be leaving the company in two weeks time. \n\nIt is truly sad to see you go, not only were you a tremendous help to us, you are also a great friend to many of us in the team. \n\nAll the best in your future endeavours, and please do stay in touch! \n\nRegards,\nTim", "summary": "- Give farewell to recipient"}
{"email": "Dear Mr Tan,\n\nThank you for meeting with me today, it was truly a pleasure talking with you!\n\nI would like to arrange another meeting with you sometime this week to talk about the options available for your insurance plan, is that alright with you?\n\nRegards,\nHarry", "summary": "- Arrange meeting this week"}
{"email": "Dear Johnson,\n\nI heard from Susan that you had some concerns with the project proposal that I presented earlier today. I truly believe in the potential of this project idea and would like to address all the concerns that you might have. \n\nIf possible, could you respond to this email with the issues that you have with the proposal?\n\nRegards,\nLeon", "summary": "- Ask for feedback about project proposal"}
{"email": "Dear Corrine,\n\nThank you for checking in with me. I am currently facing an issue with our company software. It is highly unresponsive whenever I try to enter data into the system. \n\nCould you send some help my way? It would be greatly appreciated!\n\nRegards,\nLuke", "summary": "- Ask for assistance with work"}
{"email": "Dear Rachel,\n\nApologies for my blunder earlier, I had forgotten to attach the report mentioned in my previous email. \n\nHere it is!\n\nRegards,\nKathy", "summary": "- Apologise for forgetting to attach attachment"}
{"email": "Dear Mrs Han,\n\nThe results for your medical check-up last week are out. \n\nOverall, you are in good health! Just remember to eat healthy and stay hydrated. \n\nAttached is your health report in case you are interested in the details.\n\nRegards,\nDr Kimberly", "summary": "- Inform that medical check-up results are out\n- Send health report as attachment"}
{"email": "Dear Veronica,\n\nThank you for your presentation earlier on your project proposal. Unfortunately, while the higher ups loved your idea, we are currently unable to accept it due to financial constraints. \n\nWould it be possible for you to revise some of the budgets allocated?\n\nRegards,\nRon", "summary": "- Give feedback on project proposal\n- Ask for a revision on the project proposal"}
{"email": "Dear Fyonn,\n\nThe CTO is organising a company wide D&D session to celebrate the success of our recent project. Could you kindly confirm your attendance by responding to this email?\n\nRegards,\nThomas", "summary": "- Confirm attendance for D&D event"}
{"email": "Hey Paul,\n\nThis is Dean from IT. \n\nWe recently published our website using the web development frameworks you recommended. The website turned out great and I thought you might want to have a look!\n\nCheers,\nDean", "summary": "NONE"}
{"email": "Hey Steven,\n\nI wanted to follow up with you regarding our previous correspondence. Have you been able to get the information that I requested in my last email?\n\nIn case you forgot, I have copied my previous email below for your reference.\n\nCheers,\nJose", "summary": "- follow up with previous email"}
{"email": "Dear Mr Lim,\n\nI hope all is well. I had fun meeting you and designing our project presentation together last Tuesday. \n\nI know we agreed that I would make a PowerPoint presentation, but I do not have any way to save my work after each session. If possible, could you bring a thumbdrive tomorrow? \n\nRegards,\nDerrick", "summary": "- Ask recipient to bring thumbdrive tomorrow"}
{"email": "Hello Brian,\n\nWe just want to take this opportunity to thank you for choosing us as your company's provider of fire safety equipment and inspections. We are proud of our satisfied clientele and look forward to many years of working together.\n\nYou'll be getting an email soon from your account representative, but if you have any questions in the meantime, you can respond to this email with any enquiries you might have!\n\nThank you again for your business, and have a great day!\n\nRegards,\nLucas", "summary": "- Inform recipient of succesful business transaction"}
{"email": "Hello Naomi,\n\nThank you for lending your assistance in my project. With your help, I am finally able to move on to other items on our backlog. \n\nPlease do let me know if I could be of assistance to you as well!\n\nRegards,\nJames", "summary": "- Thank recipient for assistance\n- Offer assistance if needed"}
{"email": "Good afternoon everyone,\n\nI need to be out of the office on Wednesday, June 28, but I'm still looking for someone to cover my shift that day. If you're interested in swapping shifts with me, please give me a call or respond to this email and we can work something out.\n\nThanks,\nJeffrey ", "summary": "- look for people to swap shifts with"}
{"email": "Dear Johanna,\n\nAs we've recently discussed, your absenteeism is negatively affecting both your individual performance at work and your team's productivity. We take attendance at work seriously and we expect all our employees to comply with our company's policy regarding time off.\n\nThis is your first warning notice. We hope that you will correct your behavior and request time off in advance and in a formal manner. Otherwise, further disciplinary action might be taken.\n\nI'm available to discuss any complications you face that causes your absence at work. Do contact me if there is any way that I could be of help to you!\n\nSincerely,\nTasha", "summary": "- provide negative feedback on workplace behavior\n- give warning notice\n- provide assistance if needed"}
{"email": "Dear Brianna,\n\nI am writing this email to ask if you could help approve my leave request for April. I applied for the leave over two weeks ago but I have yet to receive any confirmation from the HR department.\n\nLet me know if you need anything from my side!\n\nRegards,\nHubert", "summary": "- Ask for assistance in approving time off"}
{"email": "Dear Jonah,\n\nI have noticed that your job performance has been decreasing lately. Not only have you not been meeting job quotas, your teammates have also complained that you do not take your work seriously.\n\nNormally, this would have been grounds for a poor annual work performance review, but I would like to give you a chance to share any issues that you might be facing as in the past your work quality has always been one of the best in the company.\n\nI hope to hear from you soon!\n\nSincerely,\nHarvey", "summary": "- Provide negative feedback on work performance\n- Ask recipient to share issues that he might be facing"}
{"email": "Hey Rudy,\n\nI read from your previous email that you would like to hold a meeting with the team on Tuesday. However, you did not indicate an agenda for the meeting, nor the things to prepare.\n\nCould you revise the details and send another invitation over?\n\nSincerely,\nChloe", "summary": "- Ask for more details regarding the meeting"}
{"email": "Dear Steve,\n\nI am writing this email to recommend Peter for the role as Tech Lead. I have worked with him closely for the last two years and have no doubt of his capabilities in the field of robotics.\n\nHe has always put a premium on timeliness and throughness among my team members and he has never failed to deliver. \n\nI truly believe that he has what it takes.\n\nSincerely,\nJay", "summary": "- Recommend co-worker for promotion"}
{"email": "Hello Dion,\n\nAs you may already know, there has been a few cases of COVID-19 in the office recently. Upper management has asked me to inform you to work from home if possible, and only come to the office if its necessary. \n\nThank you for your efforts during this trying time!\n\nSincerely,\nKelly", "summary": "- Inform recipient of new office measures"}
{"email": "Hello Mr Koh,\n\nThank you for reaching out. I definitely understand your concern and I am escalating your issues so that someone else can take a closer look at what is going on.\n\nOne of my team mates will be in contact with you in the next few days. \n\nSincerely,\nVinny", "summary": "- Inform recipient of a contact in the next few days"}
